<!-- dflook/terraform-github-actions {"workspace":"staging","backend_type":"s3","label":"staging","backend":"a5c64cff93bcb6dba1feffdcd996d44a526c587040c7aaaa84a09d4bc3506615","plan_job_ref":"Job plan #15 at https://github.com/GSA/usnotify-ssb/actions/runs/4915872068","plan_hash":"25c5948a5faff9a19a7d88e3e9bb0e220d80bbb799f8b5859d0a863b2aee966b","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.broker_sms.cloudfoundry_app.ssb must be replaced
-/+ resource "cloudfoundry_app" "ssb" {
      + health_check_http_endpoint      = (known after apply)
      ~ health_check_invocation_timeout = 0 -> (known after apply)
      ~ health_check_timeout            = 0 -> (known after apply)
      ~ id                              = "************************************" -> (known after apply)
      ~ id_bg                           = "************************************" -> (known after apply)
      ~ name                            = "ssb-sms-venerable" -> "ssb-sms"
      ~ ports                           = [
          - 8080,
        ] -> (known after apply)
      ~ source_code_hash                = "Azau63OizjMPWBKlG+JGVKz6I48LdURxiTCOOxPZBzA=" -> "I6Kpq+JzVlzxHC16zHAwQgB8YrcotCVUnYVyCN/TZf0="
      ~ stack                           = "cflinuxfs4" -> "793876df-45b2-43cc-adcd-ccf88fea63f5" # forces replacement
      ~ strategy                        = "blue-green" -> "rolling"
        # (12 unchanged attributes hidden)

      - routes {
          - port  = 8080 -> null
          - route = "3d524868-7061-4ab6-8048-c97c775df9a9" -> null
        }
      + routes {
          + port  = (known after apply)
          + route = "3d524868-7061-4ab6-8048-c97c775df9a9"
        }

      ~ service_binding {
          - params           = (sensitive value) -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.broker_smtp.cloudfoundry_app.ssb must be replaced
-/+ resource "cloudfoundry_app" "ssb" {
      + health_check_http_endpoint      = (known after apply)
      ~ health_check_invocation_timeout = 0 -> (known after apply)
      ~ health_check_timeout            = 0 -> (known after apply)
      ~ id                              = "************************************" -> (known after apply)
      ~ id_bg                           = "************************************" -> (known after apply)
        name                            = "ssb-smtp"
      ~ ports                           = [
          - 8080,
        ] -> (known after apply)
      ~ stack                           = "cflinuxfs4" -> "793876df-45b2-43cc-adcd-ccf88fea63f5" # forces replacement
      ~ strategy                        = "blue-green" -> "rolling"
        # (13 unchanged attributes hidden)

      - routes {
          - port  = 8080 -> null
          - route = "4dde2fc3-7d82-4c81-8e92-d4920fcd4510" -> null
        }
      + routes {
          + port  = (known after apply)
          + route = "4dde2fc3-7d82-4c81-8e92-d4920fcd4510"
        }

      ~ service_binding {
          - params           = (sensitive value) -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>

:x: Error applying plan in [apply #16](https://github.com/GSA/usnotify-ssb/actions/runs/4915940080)